In [3]:
import numpy as np
import pandas as pd

**1. Student Performance Analysis**

**Sample DataFrame**:

```python
students_df = pd.DataFrame({
    'Student_ID': list(range(1, 11)),
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Hannah', 'Isaac', 'Jack'],
    'Math_Score': [82, 95, 88, 65, 78, 90, 55, 92, 87, 79],
    'English_Score': [85, 89, 78, 70, 92, 75, 88, 95, 80, 85],
    'History_Score': [90, 87, 82, 68, 95, 78, 88, 85, 76, 79]
})
```

**Given Query**: 
"Identify the students who have scored above the average in all subjects. Also, determine the subject in which the highest aggregate score was achieved across all students."

In [4]:
students_df = pd.DataFrame({
    'Student_ID': list(range(1, 11)),
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Hannah', 'Isaac', 'Jack'],
    'Math_Score': [82, 95, 88, 65, 78, 90, 55, 92, 87, 79],
    'English_Score': [85, 89, 78, 70, 92, 75, 88, 95, 80, 85],
    'History_Score': [90, 87, 82, 68, 95, 78, 88, 85, 76, 79]
})

In [5]:
students_df

   Student_ID     Name  Math_Score  English_Score  History_Score
0           1    Alice          82             85             90
1           2      Bob          95             89             87
2           3  Charlie          88             78             82
3           4    David          65             70             68
4           5      Eve          78             92             95
5           6    Frank          90             75             78
6           7    Grace          55             88             88
7           8   Hannah          92             95             85
8           9    Isaac          87             80             76
9          10     Jack          79             85             79

In [22]:
#The students who have scored above the average in all subjects.
students_above_avg_all=students_df.loc[((students_df['Math_Score']>students_df['Math_Score'].mean()) & (students_df['English_Score']>students_df['English_Score'].mean()) & (students_df['History_Score']>students_df['History_Score'].mean())),'Name'].to_list()

#The subject in which the highest aggregate score achieved accross all students.
sub_high_agg_score=students_df[['Math_Score', 'English_Score', 'History_Score']].sum().idxmax().split('_')[0]

print(f"The students who have scored above the average in all subjects are {students_above_avg_all}")
print(f"\n'{sub_high_agg_score}' is the subject in which the highest aggregate score was achieved accross all students")

The students who have scored above the average in all subjects are ['Alice', 'Bob', 'Hannah']

'English' is the subject in which the highest aggregate score was achieved accross all students

**2. Sales Rep Performance Metrics**

**Sample DataFrame**:
```python
sales_rep_df = pd.DataFrame({
    'Sales_Rep_ID': list(range(1, 6)),
    'Name': ['Olivia', 'Ethan', 'Sophia', 'James', 'Emily'],
    'Total_Sales': [15000, 16500, 14200, 15800, 14800],
    'Total_Clients': [12, 15, 10, 14, 13],
    'Region': ['North', 'South', 'East', 'West', 'North']
})
```

**Given Query**: 
"Find out which 'Region' has the highest average sales per representative. Additionally, identify the sales representative with the highest sales-to-client ratio."

In [24]:
sales_rep_df = pd.DataFrame({
    'Sales_Rep_ID': list(range(1, 6)),
    'Name': ['Olivia', 'Ethan', 'Sophia', 'James', 'Emily'],
    'Total_Sales': [15000, 16500, 14200, 15800, 14800],
    'Total_Clients': [12, 15, 10, 14, 13],
    'Region': ['North', 'South', 'East', 'West', 'North']
})

In [30]:
sales_rep_df

   Sales_Rep_ID    Name  Total_Sales  Total_Clients Region
0             1  Olivia        15000             12  North
1             2   Ethan        16500             15  South
2             3  Sophia        14200             10   East
3             4   James        15800             14   West
4             5   Emily        14800             13  North

In [41]:
#'Region' with the highest average sales per representative.
reg_high_avg_sales=sales_rep_df.groupby('Region')['Total_Sales'].mean().idxmax()

#The sales representative with the highest sales-to-client ratio.
rep_with_high_sales_to_client=sales_rep_df.loc[np.round(sales_rep_df['Total_Sales']/sales_rep_df['Total_Clients'],2).idxmax(),'Name']

print(f"'{reg_high_avg_sales}' is the region with the highest average sales per representative.")
print(f"\n'{rep_with_high_sales_to_client}' is the sales representative with the highest sales-to-client ratio.")

'South' is the region with the highest average sales per representative.

'Sophia' is the sales representative with the highest sales-to-client ratio.